'''
分类：
1. 算数运算符
2. 赋值运算符
3. 复合赋值运算符
4. 比较运算符
5. 逻辑运算符
'''

# 算数运算符
print('--------------- 算数运算符 ----------------')

print(1 + 1)  # 2

print(1 - 0.5)  # 0.5

print(2 * 3)  # 6

print(2 * 0.5)  # 1.0 保留浮点数

print(2 / 1)  # 2.0 除法取值为浮点数

print(9 // 4)  # 2 取商

print(9 % 4)  # 1 取余

print(1 + 2 * 3)  # 7 乘法有更高的优先级

print((1 + 2) * 3)  # 9 小括号提升优先级

# 优先级：() 高于 ** 高于 * / // % 高于 + -

# -------------------------------------------------------

# 赋值运算符
print('--------------- 赋值运算符 ----------------')

a = 10  # 单个变量赋值
print(a)

b, c, d = 1, 1.1, 'string'  # 多个变量赋值
print(f'{b}, {c}, {d}')

e = f = True  # 多个变量赋相同值
print(f'{e}, {f}')

# -------------------------------------------------------

# 复合赋值运算符
print('--------------- 复合赋值运算符 ----------------')

g = 10
g += 10  # 加法赋值运算符
# g -= 10
# g *= 10
# g /= 10
# g //= 10
# g %= 10
# g **= 10
print(g)

# -------------------------------------------------------

# 比较运算符
print('--------------- 比较运算符 ----------------')

print(1 == 2)  # 相等
print(1 != 2)  # 不相等
print(1 > 2)  # 大于
print(1 < 2)  # 小于
print(1 >= 2)  # 大于等于
print(1 <= 2)  # 小于等于

# -------------------------------------------------------

# 逻辑运算符
print('--------------- 逻辑运算符 ----------------')

print(True and False)  # 全真才真
print(True and True)

print(True or False)  # 一真则真
print(False or False)

print(not True)  # 取反
